app/views/doctors/show.html.erb

	  </tr>
	  <% @doctor.has_hospitals.each do |element| %>
---
SELECT "hospitals".* FROM "hospitals" WHERE 1=0