app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "year", "title") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Нина"], ["year", "1981"], ["title", "медсестра"]]
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "doctors" SET "name" = $1 WHERE "doctors"."id" = $2  [["name", "Иванjd"], ["id", 1]]
---
  def update
    @doctor = Doctor.find(params[:id])
    respond_to do |format|
      if @doctor.update(doctor_params)

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_doctor
    @doctor = DoctorDecorator.decorate(Doctor.find(params[:id]))