app/controllers/hospitals_controller.rb

  def index
    @hospitals = Hospital.all
---
SELECT "hospitals".* FROM "hospitals"

  def create
    @hospital = Hospital.new(hospital_params)

    if @hospital.save
---
INSERT INTO "hospitals" ("name") VALUES ($1) RETURNING "id"  [["name", "Больница №15"]]

  def update
    notice = SHospital::Update.new(@hospital, params).main
    respond_to do |format|
      if @hospital.save
---
UPDATE "hospitals" SET "doctors" = $1 WHERE "hospitals"."id" = $2  [["doctors", "{1}"], ["id", 1]]

  def destroy
    @hospital = Hospital.find(params[:id])
    @hospital.destroy
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = $1 LIMIT 1  [["id", 12]]
DELETE FROM "hospitals" WHERE "hospitals"."id" = $1  [["id", 12]]

  def remove_doctor
    notice = SHospital::RemoveDoctor.new(@hospital, params).main
    respond_to do |format|
      if @hospital.save
---
UPDATE "hospitals" SET "doctors" = $1 WHERE "hospitals"."id" = $2  [["doctors", "{3}"], ["id", 23]]

  def set_hospital
    @hospital = HospitalDecorator.decorate(Hospital.find(params[:id]))
---
SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = $1 LIMIT 1  [["id", 23]]